app/controllers/trees_controller.rb

  def index
    @tree = Tree.all
---
SELECT "trees".* FROM "trees"

  def create
    tree_hash = params.delete('tree')
    a = Tree.new
    a.name = tree_hash['name']
    a.species = tree_hash['species']
    a.diameter = tree_hash['diameter']
<<<<<<< HEAD
    t = TreeService.new(a.diameter)
    a.mass = t.calculate_mass.round(2)
    a.co2_removed = t.calculate_co2.round(2)
=======
    a.mass = tree_hash['mass']
    a.co2_removed = tree_hash['co2_removed']
>>>>>>> f918c4afd076216ea7bf4436dc327385912192a0
    a.user_id = tree_hash['user_id']

    if a.save
---
INSERT INTO "trees" ("name", "species", "diameter", "mass", "co2_removed", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    id = params[:id]
    @tree = Tree.find(id)
---
SELECT  "trees".* FROM "trees" WHERE "trees"."id" = $1 LIMIT 1  [["id", 2]]

  def show
    id = params[:id]
    @tree = Tree.find(id)
---
SELECT  "trees".* FROM "trees" WHERE "trees"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    id = params['id']
    Tree.delete(id)
---
DELETE FROM "trees" WHERE "trees"."id" = $1  [["id", 2]]