app/controllers/users_controller.rb

  def create
    user_hash = params.delete('user')
    a = User.new
    a.first_name = user_hash['first_name']
    a.last_name = user_hash['last_name']
    a.email = user_hash['email']
    a.university_or_school = user_hash['university_or_school']

    if a.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "university_or_school", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    id = params[:id]
    @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    id = params[:id]
    @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]